In [38]:
import pandas as pd

In [11]:
#내가한거
data={'환자코드':['A00301','D00809'],
      '연령':[23,53],
      '성별':['남','여'],
      '거주지':['서울특별시','제주특별자치도']}
x=pd.DataFrame(data,columns=['환자코드','연령','성별','거주지'])
x

     환자코드  연령 성별      거주지
0  A00301  23  남    서울특별시
1  D00809  53  여  제주특별자치도

In [15]:
#집어넣는방식
df=pd.DataFrame([['환자 코드','연령','성별','거주지'],
                 ['A00301',23,'남','서울특별시'],
                 ['D00809',53,'여','제주특별자치도']])
display(df)

        0   1   2        3
0   환자 코드  연령  성별      거주지
1  A00301  23   남    서울특별시
2  D00809  53   여  제주특별자치도

123

In [3]:
df=pd.DataFrame([[23,'남','서울특별시'],
                 [53,'여','제주특별자치도']],
                 index=['A00301','D00809'],
                 columns=['연령','성별','거주지'])
display(df)
print('\n')
print(df.index)
print(df.columns)

        연령 성별      거주지
A00301  23  남    서울특별시
D00809  53  여  제주특별자치도

Index(['A00301', 'D00809'], dtype='object')
Index(['연령', '성별', '거주지'], dtype='object')

In [4]:
df.rename(index={'A00301':'환자1','D00809':'환자2'}, inplace=True)
df.rename(columns={'연령':'age','성별':'gender','거주지':'addr'}, inplace=True)
display(df)

     age gender     addr
환자1   23      남    서울특별시
환자2   53      여  제주특별자치도

In [12]:
#loc index기준으로 선택
#iloc 특정 위치를  index 정수값으로 지정하여 선택
df.loc[['환자1']] #display 출력을 할려면 ['index']  형태로 입력해야 dataframe 형태로 출력가능

     age gender   addr
환자1   23      남  서울특별시

In [11]:
df.iloc[0:1] #display 출력을 할려면 '0:1' 콜론하고 범위 형태로 입력해야 dataframe 형태로 출력가능

     age gender   addr
환자1   23      남  서울특별시

In [111]:
a = pd.DataFrame([['이겨레',23, '남', 185, 89], 
                  [ '조약돌',19, '여', 163, 53]],
                  index=[0,1],
                  columns=[ '성명','나이', '성별', '키', '체중'])
display(a)

    성명  나이 성별    키  체중
0  이겨레  23  남  185  89
1  조약돌  19  여  163  53

In [21]:
a.loc[[0]]

    성별  나이 성별    키  체중
0  이겨레  23  남  185  89

In [25]:
a.iloc[:1]

    성별  나이 성별    키  체중
0  이겨레  23  남  185  89

In [31]:
search_01=a.loc[[0]]
display(search_01)
position_01 =a.iloc[:1]
display(position_01)

    성별  나이 성별    키  체중
0  이겨레  23  남  185  89

    성별  나이 성별    키  체중
0  이겨레  23  남  185  89

In [36]:
search_02=a.loc[[0,1]]
display(search_02)
position_02 =a.iloc[:2]
display(position_02)

    성별  나이 성별    키  체중
0  이겨레  23  남  185  89
1  조약돌  19  여  163  53

    성별  나이 성별    키  체중
0  이겨레  23  남  185  89
1  조약돌  19  여  163  53

In [42]:
a[['성명']]

    성명
0  이겨레
1  조약돌

In [43]:
a[['나이']]

   나이
0  23
1  19

In [44]:
a[['성명','키','체중']]

    성명    키  체중
0  이겨레  185  89
1  조약돌  163  53

In [55]:
a.나이

0    23
1    19
Name: 나이, dtype: int64

In [57]:
com = pd.DataFrame([[869,374,569,197], 
                   [578,286,427,89],
                   [321,148,335,66]],
                  index=['서울지점','부산지점','제주지점'],
                  columns=[ '컴퓨터','모니터', '노트북', '스마트폰']) 
display(com)

      컴퓨터  모니터  노트북  스마트폰
서울지점  869  374  569   197
부산지점  578  286  427    89
제주지점  321  148  335    66

In [65]:
com.컴퓨터

서울지점    869
부산지점    578
제주지점    321
Name: 컴퓨터, dtype: int64

In [67]:
com[['컴퓨터','모니터']] #DataFrame 출력은 [[]] 2개가 정석

      컴퓨터  모니터
서울지점  869  374
부산지점  578  286
제주지점  321  148

In [72]:
#행 추가 + 기존에있던 요소들을 바꿔주기도한다
# a.loc[1]=[1,2,3,4,5]
# 이렇게한다면 1열에 있는 요소들이 뒤에있는 리스트에 맞게 바껴진다.
a.loc[2]=0
a

    성명  나이 성별    키  체중
0  이겨레  23  남  185  89
1  조약돌  19  여  163  53
2    0   0  0    0   0

In [73]:
a.loc[3]=['강산애',27,'남',177,63]
a

    성명  나이 성별    키  체중
0  이겨레  23  남  185  89
1  조약돌  19  여  163  53
2    0   0  0    0   0
3  강산애  27  남  177  63

In [75]:
a.loc['추가']=a.loc[2]
a

     성명  나이 성별    키  체중
0   이겨레  23  남  185  89
1   조약돌  19  여  163  53
2     0   0  0    0   0
3   강산애  27  남  177  63
추가    0   0  0    0   0

In [112]:
a

    성명  나이 성별    키  체중
0  이겨레  23  남  185  89
1  조약돌  19  여  163  53

In [116]:
a.loc[0,'키']
# a.iloc[0,3]

185

In [89]:
a.iloc[0,3:4]

키    185
Name: 0, dtype: object

In [118]:
a = pd.DataFrame([['이겨레',23, '남', 185, 89], 
                  [ '조약돌',19, '여', 163, 53]],
                  index=[0,1],
                  columns=[ '성명','나이', '성별', '키', '체중'])
display(a)

    성명  나이 성별    키  체중
0  이겨레  23  남  185  89
1  조약돌  19  여  163  53

In [119]:
a['BMI']=0
a

    성명  나이 성별    키  체중  BMI
0  이겨레  23  남  185  89    0
1  조약돌  19  여  163  53    0

In [120]:
a.iloc[0,5]=26.00
a.iloc[1,5]=19.95
a

    성명  나이 성별    키  체중    BMI
0  이겨레  23  남  185  89  26.00
1  조약돌  19  여  163  53  19.95

In [126]:
a.loc[2,:]=['강산애',27,'남',177,63,16] #loc는 추가 가능 iloc는 추가 x  추가해줄값은 리스트형태 [] 해줘야함
a

    성명    나이 성별      키    체중    BMI
0  이겨레  23.0  남  185.0  89.0  26.00
1  조약돌  19.0  여  163.0  53.0  19.95
2  강산애  27.0  남  177.0  63.0  16.00